<?xml version="1.0" encoding="ISO-8859-1"?>
<!--
 -  
 -  This file is part of the OpenLink Software Virtuoso Open-Source (VOS)
 -  project.
 -  
 -  Copyright (C) 1998-2018 OpenLink Software
 -  
 -  This project is free software; you can redistribute it and/or modify it
 -  under the terms of the GNU General Public License as published by the
 -  Free Software Foundation; only version 2 of the License, dated June 1991.
 -  
 -  This program is distributed in the hope that it will be useful, but
 -  WITHOUT ANY WARRANTY; without even the implied warranty of
 -  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU
 -  General Public License for more details.
 -  
 -  You should have received a copy of the GNU General Public License along
 -  with this program; if not, write to the Free Software Foundation, Inc.,
 -  51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA
 -  
 -  
-->
<refentry id="fn_isfinitenumeric">
  <refmeta>
    <refentrytitle>isfinitenumeric</refentrytitle>
    <refmiscinfo>type</refmiscinfo>
    <refmiscinfo>number</refmiscinfo>
  </refmeta>
  <refnamediv>
    <refname>isfinitenumeric</refname>
    <refpurpose>returns 1 if its argument is of numeric type and
its value is plain valid numeric value.</refpurpose>
  </refnamediv>
  <refsynopsisdiv>
    <funcsynopsis id="fsyn_isfinitenumeric">
      <funcprototype id="fproto_isfinitenumeric">
        <funcdef><function>isfinitenumeric</function></funcdef>
        <paramdef><parameter>arg</parameter> anything</paramdef>
      </funcprototype>
    </funcsynopsis>
  </refsynopsisdiv>
  <refsect1 id="desc_isfinitenumeric"><title>Description</title>
    <para>isfinitenumeric returns 1 if its argument is of numeric type and
its value is plain valid numeric value, not a peculiarity like infinity
or not-a-number.
    </para>
  </refsect1>
    <refsect1 id="examples_isfinitenumeric"><title>Examples</title>
  <example id="ex_isfinitenumeric"><title>Simple Use</title>
<programlisting><![CDATA[
SQL>  SPARQL 
INSERT INTO GRAPH <http://mygraph.com>
  { 
    <http://mygraph2.com/pricing/#QVal1> <price1>  1 ;    <price2> "";    <price3> 5 .
    <http://mygraph2.com/pricing/#QVal2> <price1>  "" ;   <price2> 1 ;    <price3> 4 .
    <http://mygraph2.com/pricing/#QVal3> <price1>  6 ;    <price2> 2 ;    <price3> "".
  };
  
Insert into <http://mygraph.com>, 9 (or less) triples -- done
No. of rows in result: 1

SQL> SPARQL SELECT ?s (bif:isfinitenumeric(?pr1))
FROM <http://mygraph.com>
WHERE 
  {
    ?s <price1> ?pr1 ;  
       <price2> ?pr2 ;  
       <price3> ?pr3 
  };  	
  
Query result:
s                                     callret-1
VARCHAR 	                            INTEGER
_______________________________________________
http://mygraph2.com/pricing/#QVal2	 0
http://mygraph2.com/pricing/#QVal1	 1
http://mygraph2.com/pricing/#QVal3	 1

No. of rows in result: 3  	  
]]></programlisting>
  </example>
  </refsect1>
</refentry>


